

/******************************************************************************/
/* 头文件包含 */
#include "HAL.h"

/**************************************************************************************************
 *                                        GLOBAL VARIABLES
 **************************************************************************************************/


/**************************************************************************************************
 *                                        FUNCTIONS - Local
 **************************************************************************************************/

void Audio_play(uint8_t *txt, uint8_t length)
{
    uint8_t  headOfFrame[5];
    uint16_t   i = 0;

    headOfFrame[0] = 0xFD ;       //构造帧头FD
    headOfFrame[1] = 0x00 ;       //构造数据区长度的高字节
    headOfFrame[2] = length + 2;  //构造数据区长度的低字节
    headOfFrame[3] = 0x01 ;       //构造命令字：合成播放命令
    headOfFrame[4] = 0x01 ;       //构造命令参数：编码格式为GBK
     
    UART3_SendString(headOfFrame, sizeof(headOfFrame));//依次发送构造好的5个帧头字节
    UART3_SendString(txt, length);//依次发送构造好的5个帧头字节
}


/******************************** endfile @ key ******************************/
